# üìã Comandos Disponibles - WiFi Jammer

## üîß COMANDOS B√ÅSICOS

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `setchannel <channel>` | Cambiar canal WiFi | `setchannel 6` (2.4GHz: 1-14, 5GHz: 36-165) |
| `setband <band>` | Cambiar banda | `setband 2.4` o `setband 5` |
| `getrssi` | Mostrar RSSI del √∫ltimo paquete | `getrssi` |
| `status` | Mostrar estado y estad√≠sticas actuales | `status` |

## üîç ESCANEO

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `scan <start> <stop>` | Escanear rango de canales por se√±al | `scan 1 14` |
| `wifiscan [duration]` | Escanear y listar redes WiFi | `wifiscan 5` (default: 3 seg) |

## üì° RECEPCI√ìN/TRANSMISI√ìN

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `rx` | Activar/desactivar recepci√≥n de paquetes | `rx` |
| `tx <hex-vals>` | Enviar paquete WiFi (formato hexadecimal) | `tx AABBCCDD` |
| `chat` | Modo chat (env√≠o/recepci√≥n de texto) | `chat` |

## üéØ JAMMING (Interferencia WiFi)

El comando `jam` tiene m√∫ltiples opciones para saturar redes WiFi:

### Opciones de Jamming:

| Comando | Descripci√≥n | Efecto |
|---------|-------------|--------|
| `jam` | Canal actual | Interfiere solo el canal actual |
| `jam <canal>` | Canal espec√≠fico | Interfiere un canal espec√≠fico | `jam 6` |
| `jam 2.4` | Banda 2.4 GHz | Interfiere TODOS los canales 1-14 simult√°neamente | `jam 2.4` |
| `jam 5` | Banda 5 GHz | Interfiere TODOS los canales 5GHz simult√°neamente | `jam 5` |
| `jam all` | Todas las bandas | Interfiere TODOS los canales (2.4 y 5 GHz) simult√°neamente | `jam all` |
| `jam <bssid>` | Red espec√≠fica | Interfiere una red espec√≠fica por MAC | `jam AA:BB:CC:DD:EE:FF` |
| `jam <canal> <bssid>` | Red en canal | Interfiere red espec√≠fica en canal espec√≠fico | `jam 6 AA:BB:CC:DD:EE:FF` |
| `jam 2.4 <bssid>` | Red en banda 2.4 | Interfiere red en todos los canales 2.4GHz | `jam 2.4 AA:BB:CC:DD:EE:FF` |
| `jam 5 <bssid>` | Red en banda 5 | Interfiere red en todos los canales 5GHz | `jam 5 AA:BB:CC:DD:EE:FF` |
| `jam all <bssid>` | Red en todas las bandas | Interfiere red en TODOS los canales | `jam all AA:BB:CC:DD:EE:FF` |

**‚ö†Ô∏è NOTA:** Los comandos `jam 2.4`, `jam 5` y `jam all` crean m√∫ltiples procesos simult√°neos para saturar todos los canales de forma inmediata.

## üíæ GRABACI√ìN

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `rec` | Activar/desactivar grabaci√≥n de paquetes | `rec` |
| `add <hex-vals>` | A√±adir paquete manualmente al buffer | `add AABBCCDD` |
| `show` | Mostrar contenido del buffer de grabaci√≥n | `show` |
| `flush` | Limpiar buffer de grabaci√≥n | `flush` |
| `play <N>` | Reproducir paquetes grabados | `play 0` (todos) o `play 3` (3er paquete) |

## üî¨ RAW MODE

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `rxraw <microseconds>` | Sniffer RAW con intervalo | `rxraw 100` |
| `recraw <microseconds>` | Grabar RAW con intervalo | `recraw 100` |
| `playraw <microseconds>` | Reproducir RAW grabado | `playraw 100` |
| `showraw` | Mostrar buffer en formato RAW | `showraw` |
| `showbit` | Mostrar buffer como bits | `showbit` |
| `addraw <hex-vals>` | A√±adir datos RAW manualmente | `addraw AABBCC` |

## üìÅ ARCHIVOS

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `save` | Guardar buffer a archivo | `save` |
| `load` | Cargar buffer desde archivo | `load` |
| `export <file>` | Exportar paquetes a PCAP (Wireshark) | `export captura.pcap` |

## üîé FILTROS

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `filter bssid <mac>` | Filtrar por BSSID/MAC | `filter bssid AA:BB:CC:DD:EE:FF` |
| `filter ssid <name>` | Filtrar por SSID | `filter ssid MiRed` |
| `filter type <type>` | Filtrar por tipo de paquete | `filter type beacon` |
| `filter clear` | Limpiar todos los filtros | `filter clear` |

## ‚öôÔ∏è OTROS

| Comando | Descripci√≥n | Ejemplo |
|---------|-------------|---------|
| `echo <0\|1>` | Activar/desactivar echo | `echo 1` (activar) |
| `init` | Reinicializar adaptador WiFi | `init` |
| `x` | Detener todas las operaciones activas | `x` |
| `quit` | Salir del programa | `quit` |
| `help` | Mostrar ayuda completa | `help` |

## ‚ö° COMANDOS ABREVIADOS (Atajos)

Puedes usar estos atajos para comandos comunes:

| Atajo | Comando Completo | Descripci√≥n |
|-------|------------------|-------------|
| `s` | `scan` | Escanear |
| `t` | `tx` | Transmitir |
| `r` | `rx` | Recibir |
| `j` | `jam` | Jamming (canal actual) |
| `j24` | `jam 2.4` | Jamming banda 2.4 GHz |
| `j5` | `jam 5` | Jamming banda 5 GHz |
| `ja` | `jam all` | Jamming todas las bandas |
| `c` | `chat` | Modo chat |
| `st` | `status` | Estado |
| `h` | `help` | Ayuda |
| `q` | `quit` | Salir |
| `x` | `x` | Detener operaciones |
| `w` | `wifiscan` | Escanear WiFi |
| `f` | `filter` | Filtrar |
| `e` | `export` | Exportar |

## üìä EJEMPLOS DE USO

### 1. Escanear redes WiFi
```
> wifiscan
> wifiscan 5  (durante 5 segundos)
```

### 2. Saturaci√≥n completa de red WiFi
```
> jam all
```

### 3. Interferir solo banda 2.4 GHz
```
> jam 2.4
```

### 4. Interferir una red espec√≠fica en todas las bandas
```
> jam all AA:BB:CC:DD:EE:FF
```

### 5. Interferir un canal espec√≠fico
```
> jam 6
```

### 6. Grabar y reproducir paquetes
```
> rec          (activar grabaci√≥n)
> rx           (activar recepci√≥n)
> show         (ver paquetes grabados)
> play 0       (reproducir todos)
```

### 7. Filtrar por red espec√≠fica
```
> filter bssid AA:BB:CC:DD:EE:FF
> rx           (solo recibir√° paquetes de esa red)
```

### 8. Exportar capturas para Wireshark
```
> export mi_captura.pcap
```

## ‚ö†Ô∏è NOTAS IMPORTANTES

1. **Permisos:** Debes ejecutar con `sudo` para que funcionen todas las caracter√≠sticas
2. **Modo Monitor:** El programa activa autom√°ticamente el modo monitor cuando es necesario
3. **Jamming Simult√°neo:** Los comandos `jam 2.4`, `jam 5` y `jam all` crean m√∫ltiples procesos para saturar todos los canales
4. **Legal:** Solo usa en redes propias o con autorizaci√≥n expl√≠cita

## üîó COMPATIBILIDAD

- Los comandos de CC1101 (como `setmhz`, `setmodulation`) se adaptan autom√°ticamente a WiFi
- El programa detecta autom√°ticamente el adaptador WiFi (wlan0, wlan1, etc.)
